import { Banner } from '../components/banner'
import bullet from '../assets/bullet.svg'
import { TermParagraph } from './term_paragraph'

const Terms = () => {
  return (
    <div className="flex flex-col w-[clamp(100px,100%,1500px)] m-[0_auto] p-[30px_50px_100px]">

        <div className="flex items-center border-b-primary border-solid border-[4px] border-t-transparent border-r-transparent border-l-transparent gap-[20px] mb-[70px]">
            <div className="w-[40px]">  
                <img src={bullet} className="w-full h-full"></img>
            </div>
            <h1 className="text-[40px] font-extrabold text-[#505050] w-full  py-[40px]
            dark:text-gray-300"> شرایط و قوانین </h1>
        </div>


        <Banner title="قوانین استفاده از خدمات آکادمی پندینگ کدینگ" />

        <TermParagraph 
         title="کاربر گرامی لطفاً موارد زیر را جهت استفاده بهینه از خدمات و برنامه‌‏های کاربردی آکادمی  پندینگ کدینگ با دقت ملاحظه فرمایید.ورود کاربران به وب‏‌سایت آکادمی پندینگ کدینگ  هنگام استفاده از پروفایل شخصی، طرح‏‌های تشویقی، ویدئوهای رسانه تصویری آکادمی  پندینگ کدینگ و سایر خدمات ارائه شده توسط آکادمی  پندینگ کدینگ به معنای آگاه بودن و پذیرفتن شرایط و قوانین و همچنین نحوه استفاده از سرویس‌‏ها و خدمات آکادمی پندینگ کدینگ  است. توجه داشته باشید که ثبت سفارش نیز در هر زمان به معنی پذیرفتن کامل کلیه شرایط و قوانین آکادمی پندینگ کدینگ  از سوی کاربر است. لازم به ذکر است شرایط و قوانین مندرج، جایگزین کلیه توافق‏‌های قبلی محسوب می‏‌شود." 
        />

        <Banner title="شرایط عودت وجه به دانشجو" />

        <TermParagraph 
         title="از آنجایی که پندینگ کدینگ یک اکادمی خصوصی در زمینه آموزش برنامه نویسی و شبکه و امنیت است. تلاش میکند تا با مدرسین خود. طبق یک قرارداد رسمی و امضا شده بین طرفین. دوره های خود را بر روی این پلتفرم منتشر کند! مدرسینی که در پندینگ کدینگ مشغول فعالیت هستند. افرادی با تجربه و باران دیده به حساب می آیند. چرا که پندینگ کدینگ با مدرسینی همکاری میکند که حداقل ۲ سال تجربه مفید و تجربه تدریس قبلی را داشته باشند. لذا اگر مدرسی بر خلاف قرارداد طرفین پیش رود و برای دوره خود پشتیبانی ارائه ندهد. پندینگ کدینگ موظف است که در اولین فرصت. مدرس دوره را تغییر دهد و اگر قرار باشد پروسه تغییر مدرس دوره کمی طول بکشد. پندینگ کدینگ موظف است که کمک پشتیبان هایی که در آن زمینه تخصص دارند را استخدام کند تا دانشجو در پروسه یادگیری. دچار اختلال نشود ! و از سمت و سویی دیگر. پندینگ کدینگ حداقل ۱۰ الی  ۳۰ درصد محتوای دوره های خود را جهت ارزیابی بهتر رایگان میکند تا دانشجو بتواند با ارزیابی بهتر در دوره مورد نظر ثبت نام کند. اگر چنانچه دانشجو. پس از یک هفته و یا ۲ ماه و…. با دلایلی همچون

         من به این پول نیاز دارم و مشکل مالی دارم
         من در فلانجا قرار شد به عنوان کار اموز پذیرفته شوم و آنها قرار است به من مهارت جدیدی بیاموزند
         من از این دوره خوشم نمی آید و میخواهم پولم را پس بگیرم
         من تغییر حوزه داده ام و نیازی به این آموزش ندارم
         و… از این قبیل
         مراجعه کند. مجموعه پندینگ کدینگ موظف نیست که مبلغ را به دانشجو عودت دهد. چرا که از قبل از طریق بخش نظرات و رایگان کردن بخش قابل توجهی از دوره. بستری برای برسی بهتر را فراهم کرده است و مسئولیت تغییر شرایط کاربر. طبق عرف به عهده خودش میباشد" 
        />
        
        <Banner title="شرایط و قوانین عمومی" />

        <TermParagraph title="توجه داشته باشید کلیه اصول و رویه‏‌های آکادمی پندینگ کدینگ منطبق با قوانین جمهوری اسلامی ایران، قانون تجارت الکترونیک و قانون حمایت از حقوق مصرف کننده است و متعاقبا کاربر نیز موظف به رعایت قوانین مرتبط با کاربر است. در صورتی که در قوانین مندرج، رویه‏‌ها و سرویس‏‌های آکادمی پندینگ کدینگ تغییراتی در آینده ایجاد شود، در همین صفحه منتشر و به روز رسانی می شود و شما توافق می‏‌کنید که استفاده مستمر شما از سایت به معنی پذیرش هرگونه تغییر است.

 
        شرایط تعریف مشتری یا کاربر
        مشتری یا کاربر به شخصی گفته می‌شود که با اطلاعات کاربری خود که در فرم ثبت‌نام درج کرده است، به ثبت سفارش یا هرگونه استفاده از خدمات آکادمی پندینگ کدینگ اقدام کند.
        همچنین از آنجا که آکادمی پندینگ کدینگ یک وب‌سایت آموزش آنلاین است، طبق قانون تجارت الکترونیک مشتری یا مصرف کننده هر شخصی است که به منظوری جز تجارت یا شغل حرفه‌ای به خرید کالا یا خدمات اقدام می‌کند.


        شرایط ارتباطات الکترونیکی
        هنگامی که شما از سرویس‌‏ها و خدمات آکادمی پندینگ کدینگ استفاده می‏‌کنید، سفارش اینترنتی خود را ثبت یا خرید می‏‌کنید و یا به آکادمی پندینگ کدینگ ایمیل می‏‌زنید، این ارتباطات به صورت الکترونیکی انجام می‏‌شود و در صورتی که درخواست شما با رعایت کلیه اصول و رویه‏‌ها باشد، شما موافقت می‌‏کنید که آکادمی پندینگ کدینگ به صورت الکترونیکی (از طریق پست الکترونیکی، سرویس پیام کوتاه و سایر سرویس‌های الکترونیکی) به درخواست شما پاسخ دهد.
        همچنین آدرس ایمیل و تلفن‌هایی که مشتری در پروفایل خود ثبت می‌کند، تنها آدرس ایمیل و تلفن‌های رسمی و مورد تایید مشتری است و تمام مکاتبات و پاسخ‌های شرکت از طریق آنها صورت می‌گیرد.
        جهت اطلاع‌رسانی رویدادها، خدمات و سرویس‌های ویژه یا پروموشن‌ها، امکان دارد آکادمی پندینگ کدینگ برای اعضای وب سایت ایمیل یا پیامک ارسال نماید. در صورتی که کاربران تمایل به دریافت اینگونه ایمیل و پیامک‌ها نداشته باشند، می‌توانند عضویت دریافت خبرنامه آکادمی پندینگ کدینگ را در پروفایل خود لغو کنند." />

        <Banner title="شرایط سیاست‏‌های رعایت حریم شخصی" />

        <TermParagraph title="آکادمی پندینگ کدینگ به اطلاعات خصوصی اشخاصى که از خدمات سایت استفاده می‏‌کنند، احترام گذاشته و از آن محافظت می‏‌کند.

        آکادمی پندینگ کدینگ متعهد می‏‌شود در حد توان از حریم شخصی شما دفاع کند و در این راستا، تکنولوژی مورد نیاز برای هرچه مطمئن‏‌تر و امن‏‌تر شدن استفاده شما از سایت را، توسعه دهد. در واقع با استفاده از سایت آکادمی پندینگ کدینگ ، شما رضایت خود را از این سیاست نشان می‏‌دهید. همه مطالب در دسترس از طریق هر یک از خدمات آکادمی پندینگ کدینگ ، مانند متن، گرافیک، آرم، آیکون دکمه، تصاویر، ویدئوهای تصویری، موارد قابل دانلود و کپی، داده‌ها و کلیه محتوای تولید شده توسط آکادمی پندینگ کدینگ جزئی از اموال آکادمی پندینگ کدینگ محسوب می‏‌شود و حق استفاده و نشر تمامی مطالب موجود و در دسترس در انحصار آکادمی پندینگ کدینگ است و هرگونه استفاده بدون کسب مجوز کتبی، حق پیگرد قانونی را برای آکادمی پندینگ کدینگ محفوظ می‏‌دارد. علاوه بر این، اسکریپت‌ها، و اسامی خدمات قابل ارائه از طریق هر یک از خدمات ایجاد شده توسط آکادمی پندینگ کدینگ و علائم تجاری ثبت شده نیز در انحصار آکادمی پندینگ کدینگ است و هر گونه استفاده با مقاصد تجاری پیگرد قانونی دارد.

        کاربران مجاز به بهره‌‏برداری و استفاده از لیست محصولات، مشخصات فنی، قیمت و هر گونه استفاده از مشتقات وب‏‌سایت آکادمی پندینگ کدینگ و یا هر یک از خدمات و یا مطالب، دانلود یا کپی کردن اطلاعات با مقاصد تجاری، هر گونه استفاده از داده کاوی، ربات، یا روش‌‏های مشابه مانند جمع آوری داده‌‏ها و ابزارهای استخراج نیستند و کلیه این حقوق به صراحت برای آکادمی پندینگ کدینگ محفوظ است.

        در صورت استفاده از هر یک از خدمات آکادمی پندینگ کدینگ ، کاربران مسئول حفظ محرمانه بودن حساب و رمز عبور خود هستند و تمامی مسئولیت فعالیت‌‏هایی که تحت حساب کاربری و یا رمز ورود انجام می‏‌پذیرد به عهده کاربران است.
        شرایط ثبت، پردازش و ارسال سفارش

        اگر شما در دوره های دانلودی پندینگ کدینگ ثبت نام کرده اید(رایگان/نقدی) به محض به پایان رساندن پروسه پرداخت. دسترسی از محصول برای شما آزاد میشود و میتوانید اقدام به مشاهده نمایید

        کاربران باید هنگام سفارش کالای مورد نظر خود، فرم سفارش را با اطلاعات صحیح و به طور کامل تکمیل کنند. بدیهی است درصورت ورود اطلاعات ناقص یا نادرست، سفارش کاربر قابل پیگیری و تحویل نخواهد بود. بنابراین درج آدرس، ایمیل و شماره تماس‌های همراه و ثابت توسط مشتری، به منزله مورد تایید بودن صحت آنها است و در صورتی که این موارد به صورت صحیح یا کامل درج نشده باشد،
        آکادمی پندینگ کدینگ جهت اطمینان از صحت و قطعیت ثبت سفارش می‌تواند از مشتری، اطلاعات تکمیلی و بیشتری درخواست کند.همچنین، مشتریان می‌توانند نام، آدرس و تلفن شخص دیگری را برای تحویل گرفتن سفارش وارد کنند و اگر مبلغ سفارش از پیش پرداخت شده باشد، تحویل گیرنده سفارش هنگام دریافت کالا باید کارت شناسایی همراه داشته باشد. – اطلاعات کاربری هر مشتری شامل نام و نام خانوادگی باید با اطلاعات مدارک شناسایی مطابقت داشته باشد و در صورت عدم تطابق، فروشگاه‌‌های اینترنتی مجاز به ارائه خدمات به این گروه از مشتریان نخواهد بود. لذا خریداران محترم می بایست با ارائه تصویر کارت ملی خود و خرید از طریق کارت بانکی متعلق به شخص خریدار که با هویت سفارش دهنده در تطابق می باشد، اقدام به ثبت سفارش نمایند. لازم به ذکر است که این امر به منظور جلوگیری از سوء استفاده‌های احتمالی و مواردی نظیر جلوگیری از خرید با کارت‌های سرقت شده و موارد مشابه در نظر گرفته شده است. – با توجه به ثبت سیستمی سفارش، به هیچ عنوان امکان صدور فاکتور مجدد یا تغییر مشخصات آن از جمله تغییر فاکتوری که به نام شخص حقیقی صادر شده، به نام شخص حقوقی وجود ندارد. بنابراین لازم است مشتریان هنگام ثبت سفارش، نسبت به این مساله دقت لازم را داشته باشند و اگر نیاز دارند که فاکتور به نام حقوقی برای آنها صادر شود، هنگام ثبت سفارش خود، با انتخاب گزینه ” تکمیل اطلاعات حقوقی ” و وارد کردن مشخصات سازمان موردنظر، برای خرید سازمانی و دریافت فاکتور رسمی اقدام کنند. همچنین آدرسی که خریدار به عنوان آدرس تحویل‌گیرنده ثبت یا انتخاب می‌کند، در فاکتور درج خواهد شد و لازم است درخواست کنندگان فاکتور به نام شخص حقوقی هنگام ثبت سفارش به این نکته توجه کافی داشته باشند، چرا که تغییر آدرس درج شده روی فاکتور پس از پردازش و تایید سفارش، به هیچ عنوان امکان‌پذیر نخواهد بود. – امکان پرداخت در محل برای سفارش‌هایی که از طریق باربری ارسال می‌شوند یا مبلغ آنها بیشتر از سی میلیون ریال است، وجود ندارد و لازم است پیش از ارسال، مبلغ اینگونه سفارش‌ها از طریق پرداخت کارت به کارت یا پرداخت اینترنتی تسویه شود." 
        />

    </div>
  )
}

export {Terms}